<template>
    <div>
        <PassengerInfoItem v-for="data in information" :key="data.id" :title="data.title" :description="data.description"/>
    </div>

</template>

<script>

    import Content from '@/components/Content';
    import PassengerInfoItem from '@/components/PassengerInfoItem';

    export default {
        data: function () {
            return {
                information: [
                    {
                        id: 1,
                        title: 'Регистрация на рейс',
                        description: 'Пассажир должен заблаговременно, не позднее установленного перевозчиком времени прибыть к месту регистрации для прохождения установленных процедур регистрации и оформления багажа, оплаты сверхнормативного багажа, прохождения досмотра, а также к месту посадки на борт воздушного судна. Регистрация пассажиров и оформление багажа на рейсы в аэропорту «Липецк» начинается согласно утверждённых правил авиакомпании-перевозчика и заканчивается не ранее чем за 40 минут до времени отправления воздушного судна по расписанию или по плану (графику) чартерных перевозок (если иное не предусмотрено перевозчиком). Регистрация пассажиров и оформление багажа производится на основании факта бронирования воздушной перевозки и документа, удостоверяющего личность пассажира, а также при необходимости иных документов, предусмотренных законодательством РФ. При заключении договора воздушной перевозки и бронировании пассажиры из числа инвалидов и других лиц с ограничениями жизнедеятельности обязаны сообщить перевозчику или агенту перевозчика ( туроператору при реализации туристического продукта ) об имеющихся у них ограничениях жизнедеятельности, а также о характеристиках индивидуальных средств передвижения (технические характеристики аккумуляторов), перевозимых на борту воздушного судна. Если Вы перевозите животное, следует предварительно согласовать перевозку животного или птицы с Авиакомпанией или ее уполномоченным агентом при бронировании и заключении договора воздушной перевозки, а также оформить необходимые документы. Документы на багаж, требующий особых условий перевозки, необходимо предоставить при регистрации для его правильного оформления. Пассажиру, опоздавшему ко времени окончания регистрации пассажиров и оформления багажа или посадки в ВС, может быть отказано в перевозке данным рейсом. Возврат денежных сумм, уплаченных за перевозку, производится по месту оплаты перевозки. Регистрация в аэропорту «Липецк» заканчивается за 40 минут до времени вылета, указанного в маршрут-квитанции ( авиабилет ). Для Web-пассажиров регистрация заканчивается за 40 минут до времени вылета, указанного в маршрут-квитанции (авиабилете) WEB-регистрация на сайтах авиакомпаний При отмене регистрации на сайте авиакомпаний повторная регистрация возможна только в аэропорту. Для пассажиров с младенцами : в самолёте предоставляются места строго по правилам авиакомпаний. Будьте внимательны при выборе места! WEB-регистрация осуществляется при отсутствии у пассажира багажа Пасссажир, имеющий багаж, должен подойти к стойке регистрации для его оформления. В аэропорту гЛипецка функции регистрации и посадки совмещены на стойке регистрации. Пассажирам, зарегистрировавшимся онлайн, необходимо для прохождения процедуры посадки подойти к стойке регистрации. Регистрация онлайн авиакомпании «РусЛайн» можно здесь. Регистрация онлайн авиакомпании «Сибирь» можно здесь.'
                    },
                    {
                        id: 2,
                        title: 'Провоз багажа',
                        description: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Magnam, quasi totam! Ad amet at, autem consequuntur doloribus, et, facere laudantium libero minima quos reprehenderit similique. Eligendi itaque quod soluta ut!'
                    },
                    {
                        id: 3,
                        title: 'Как добраться?',
                        description: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. A adipisci aspernatur consequatur, cupiditate delectus doloremque eveniet illo incidunt iure magni nesciunt obcaecati officiis possimus quidem quis recusandae reiciendis repellat, sequi!'
                    },
                    {
                        id: 4,
                        title: 'Безопасность',
                        description: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Atque ea eum impedit ipsum itaque laboriosam, laborum provident quo sapiente voluptatum! Cum dolore dolores eum ipsum laboriosam mollitia nam tenetur voluptatibus?'
                    },
                    {
                        id: 5,
                        title: 'Экстренные случаи',
                        description: 'text'
                    },
                    {
                        id: 6,
                        title: 'В случае задержки рейса',
                        description: 'text'
                    },
                    {
                        id: 7,
                        title: 'Если ваш багаж не прибыл',
                        description: 'text'
                    },
                    {
                        id: 8,
                        title: 'Выдача справки пассажирам',
                        description: 'text'
                    },
                    {
                        id: 9,
                        title: 'Прокурорский надзор',
                        description: 'text'
                    },
                    {
                        id: 10,
                        title: 'Справка',
                        description: 'text'
                    }
                ],
            }
        },
        components: {
            Content,
            PassengerInfoItem
        }
    }

</script>

<style scoped>

</style>